Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: Blessed Lord, this cultivation of the perfection of wisdom is the breaking down of the cultivation of the fruit of entering the stream to nirvāṇa.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ།
en: Blessed Lord, this cultivation of the perfection of wisdom is the breaking down of the cultivation of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this cultivation of the perfection of wisdom is the breaking down of the cultivation of all-aspect omniscience.” “

source: རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: replied the Blessed One. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་གཟུགས་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of physical forms.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of feelings, perceptions, formative predispositions, and consciousness.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་སྐྱེ་མཆེད་དང་། ཁམས་དང་།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of the sense fields, the sensory elements, {Ki.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ།
en: IV: 111} and the links of dependent origination.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་བདག་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of the self.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེས་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of sentient beings, life forms, living beings, life, living creatures, individual personalities, human beings, people, actors, experiencers, knowers, and viewers. “

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of all the perfections.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི། སྟོང་པ་ཉིད་ཐམས་ཅད་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of all the aspects of emptiness. “

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of the thirty-seven factors conducive to enlightenment.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བསྒོམ་པ་རྣམ་པར་བསྒོམ་པའོ།
en: Subhūti, this cultivation of the perfection of wisdom is the breaking down of the cultivation of [all the goals], up to and including all-aspect omniscience.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མངོན་པར་ཆགས་པ་མེད་དམ་ཞེས། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མངོན་པར་ཆགས་པ་མེད་དམ་ཞེས།
en: Then the Blessed One further addressed the venerable Subhūti as follows: “In this regard, Subhūti, bodhisattva great beings who are irreversible should investigate this profound perfection of wisdom to determine, Subhūti, if bodhisattva great beings are without attachment to this profound perfection of wisdom.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should investigate the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity to determine if bodhisattva great beings are without attachment to the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མངོན་པར་ཆགས་པ་མེད་དམ་ཞེས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should investigate the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, to determine if bodhisattva great beings are without attachment to the emptiness of the essential nature of nonentities [and so forth]. “

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་མངོན་པར་ཆགས་པ་མེད་དམ་ཞེས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་།
en: Bodhisattva great beings should investigate the thirty-seven factors conducive to enlightenment to determine whether they are not fixated on the thirty-seven factors conducive to enlightenment.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་མངོན་པར་ཆགས་པ་མེད་དམ་ཞེས་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ།
en: Bodhisattva great beings should investigate the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways to determine if they are without attachment to the dhāraṇī gateways [and so forth]. “

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་མངོན་པར་ཆགས་པ་མེད་དམ་ཞེས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ།
en: Bodhisattva great beings should investigate the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas to determine if they are without attachment to the distinct qualities of the buddhas [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མངོན་པར་ཆགས་པ་མེད་དམ་ཞེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་བརྟག་པར་བྱའོ།
en: Bodhisattva great beings should investigate [the goals], up to and including all-aspect omniscience, to determine if they are without attachment to all-aspect omniscience [and so forth]. “

source: །ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་ཚེ།
en: When those bodhisattva great beings who are irreversible practice this profound perfection of wisdom, they should investigate if they are not viewing the words spoken by others and the intimations revealed by others to be of import.

source: ཕ་རོལ་གྱིས་སྨྲས་པ་དང་ཕ་རོལ་གྱིས་བསྟན་པ་ལ་སྙིང་པོར་མི་བལྟ་འམ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་ཚེ། ཕ་རོལ་གྱི་དད་པས་མི་འགྲོ་འམ།
en: When those bodhisattva great beings who are irreversible practice this profound perfection of wisdom, they should investigate if they are not going forward with faith in others.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་ཚེ།
en: When those bodhisattva great beings who are irreversible practice this profound perfection of wisdom, {Ki.

source: འདོད་ཆགས་དང་བཅས་པའི་སེམས་བསྐྱེད་པས་འཕྲོགས་པ་མ་ཡིན་ནམ་ཞེ་སྡང་དང་བཅས་པ་དང་། གཏི་མུག་དང་བཅས་པའི་སེམས་བསྐྱེད་པའི་འཕྲོགས་པ་མ་ཡིན་ནམ།
en: IV: 112} they should investigate if they are not being captivated by the mind-sets of desire, and if they are not being captivated by the mind-sets of hatred and delusion.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མ་གྱུར་ཏམ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མ་གྱུར་ཏམ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མ་གྱུར་ཏམ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མ་གྱུར་ཏམ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མ་གྱུར་ཏམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མ་གྱུར་ཏམ། ཞེས་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། གལ་ཏེ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཆད་པའི་ཚེ། མི་འཇིགས་མི་དངང་སྐྲག་པར་མི་འགྱུར་ལ་ཞུམ་པ་དང་། ཡོངས་སུ་ཞུམ་པར་མི་འགྱུར་ཞིང་། དེའི་ཡིད་ཕྱིར་ནུར་བར་མི་འགྱུར་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་པར་དཀའ་ལ།
en: When those bodhisattva great beings who are irreversible practice this profound perfection of wisdom, they should investigate if they are not diverging from the perfection of generosity, if they are not diverging from the perfection of ethical discipline, if they are not diverging from the perfection of tolerance, if they are not diverging from the perfection of perseverance, if they are not diverging from the perfection of meditative concentration, and if they are not diverging from the perfection of wisdom. “

source: ཐོས་ནས་ཀྱང་འཛིན་ཅིང་འཆང་ལ། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་དེ། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ལ། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་དུ་བྱེད་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ནི་སྔོན་གྱི་མཐར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཡོངས་སུ་དྲིས་ཤིང་ཡོངས་སུ་བརྟག་པ་བྱས་པ་དང་།
en: If, when those bodhisattva great beings who are irreversible practice this profound perfection of wisdom, they are not afraid or terrified, they do not grow fearful, they are not cowed or intimidated, their minds are not dissuaded, and they delight in hearing this profound perfection of wisdom—and having studied it, they take up, uphold, recite, master, and focus their attention correctly on it, and earnestly apply it in an authentic manner—then, Subhūti, you should know that those bodhisattva great beings in their former lives, too, will have asked questions about and investigated this profound perfection of wisdom, taking up, upholding, mastering, and focusing their attention correctly on it. “

source: གཟུང་ཞིང་བཅངས་ཏེ་ཀུན་ཆུབ་པར་བྱས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་པར་རིག་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཆད་པའི་ཚེ། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ལ་ཞུམ་པར་མི་འགྱུར་ཡོངས་སུ་ཞུམ་པར་མི་འགྱུར་ཞིང་དེའི་ཡིད་ཕྱིར་མི་ལྡོག་ལ།
en: If you ask why, it is because those bodhisattva great beings will not be afraid or terrified, they will not grow fearful, and they will not be discouraged or intimidated when this profound perfection of wisdom is explained.

source: ཐོས་ནས་ཀྱང་ཆེད་དུ་འཛིན་ཅིང་འཆང་ལ་ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་དེ། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའི་ཕྱིར་རོ།
en: Their minds will not be turned away and, having heard it, they will purposefully take up, uphold, recite, master, and focus their attention correctly on it.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བསྟན་པའི་ཚེ་མི་འཇིགས་མི་དངང་སྐྲག་པར་མི་འགྱུར་ཞིང་། ཞུམ་པར་མི་འགྱུར་ཡོངས་སུ་ཞུམ་པར་མི་འགྱུར་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཇི་ལྟར་བརྟག་པར་བགྱི།
en: Blessed Lord, if bodhisattva great beings will not be afraid or terrified, and not be cowed or intimidated when this profound perfection of wisdom is revealed, then, Blessed Lord, how should those bodhisattva great beings appraise this perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གཞོལ་བའི་བསམ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བརྟག་པར་བྱའོ། །གསོལ་པ།
en: Subhūti,” replied the Blessed One, “those bodhisattva great beings should appraise this profound perfection of wisdom with their minds intent on all-aspect omniscience.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གཞོལ་བའི་བསམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟོག་པ་ལགས།
en: Blessed Lord, how do bodhisattva great beings appraise this profound perfection of wisdom with their minds intent on all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སྟོང་པ་ཉིད་ལ་གཞོལ་བའི་བསམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟོག་པ་ཡིན། རབ་འབྱོར་མཚན་མ་མེད་པ་དང་།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings appraise this profound perfection of wisdom with minds intent on emptiness.

source: སྨོན་པ་མེད་པ་ལ་གཞོལ་བའི་བསམ་པ་དང་། ནམ་མཁའ་ལ་གཞོལ་བའི་བསམ་པ་དང་། སྐྱེ་བ་མེད་པ་དང་།
en: Subhūti, they appraise this profound perfection of wisdom with their minds intent on signlessness and wishlessness, {Ki.

source: འགག་པ་མེད་པ་ལ་གཞོལ་བའི་བསམ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ལ་གཞོལ་བའི་བསམ་པ་དང་། དེ་བཞིན་ཉིད་ལ་གཞོལ་བའི་བསམ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་གཞོལ་བའི་བསམ་པ་དང་། ཡང་དག་པའི་མཐའ་ལ་གཞོལ་བའི་བསམ་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལ་གཞོལ་བའི་བསམ་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་གཞོལ་བའི་བསམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟོག་པ་ཡིན།
en: IV: 113} with their minds intent on space, with their minds intent on nonarising and nonceasing, with their minds intent on nonaffliction and nonpurification, with their minds intent on the real nature, with their minds intent on the realm of phenomena, with their minds intent on the very limit of reality, with their minds intent on the inconceivable realm, and with their minds intent on nonconditioning.

source: རྨི་ལམ་དང་གཟུགས་བརྙན་ལ་གཞོལ་བའི་བསམ་པ་དང་། སྒྲ་བརྙན་དང་། སྨིག་རྒྱུ་དང་སྒྱུ་མ་དང་སྤྲུལ་པ་ལ་གཞོལ་བའི་བསམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟོག་པ་ཡིན་ནོ།། །། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་བཅུ་དགུ་པ། གསོལ་པ། བཅོམ་ལྡན་འདས་
en: Bodhisattva great beings appraise this profound perfection of wisdom with their minds intent on dreams and reflections, and with their minds intent on echoes, mirages, magical displays, and phantom emanations.” “

source: དེ་ལྟར་སྟོང་པ་ཉིད་ལ་གཞོལ་བའི་བསམ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟོག་པར་འགྱུར་ཞིང་མཚན་མ་མ་མཆིས་པ་དང་། སྨོན་པ་མ་མཆིས་པ་དང་། ནམ་མཁའ་དང་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པ་དང་། རྣམ་པར་བྱང་བ་མ་མཆིས་པ་དང་། དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་ཡང་དག་པའི་མཐའ་དང་མཉམ་པ་ཉིད་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་མངོན་པར་འདུ་བགྱི་བ་མ་མཆིས་པ་དང་། རྨི་ལམ་དང་གཟུགས་བརྙན་དང་སྒྲ་བརྙན་དང་སྨིག་རྒྱུ་དང་སྒྱུ་མ་དང་སྤྲུལ་པ་ལ་གཞོལ་བའི་བསམ་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་རྟོག་པར་འགྱུར་ན་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་ལ་རྟོག་པ་ལགས་སམ།
en: Blessed Lord, if bodhisattva great beings appraise this profound perfection of wisdom with minds intent on emptiness and if they appraise this profound perfection of wisdom with their minds intent on signlessness, wishlessness, space, nonarising, nonceasing, nonaffliction, nonpurification, the real nature, the realm of phenomena, the very limit of reality, sameness, the inconceivable realm, nonconditioning, dreams, reflections, echoes, mirages, magical displays, and phantom emanations, then, Blessed Lord, do those bodhisattva great beings appraise physical forms?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་རྟོག་པ་ལགས་སམ།
en: Do they appraise feelings, perceptions, formative predispositions, and consciousness?

source: སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་རྟོག་པ་ལགས་སམ།
en: Do they appraise the sense fields, the sensory elements, and the links of dependent origination?

source: ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་རྟོག་པ་ལགས་སམ། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: Do they appraise any of the perfections, any of the aspects of emptiness, and the thirty-seven factors conducive to enlightenment?

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་རྟོག་པ་ལགས་སམ།
en: Do they appraise the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways?

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་རྟོག་པ་ལགས་སམ།
en: Do they appraise the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་རྟོག་པ་ལགས་སམ།
en: Do they appraise [the goals], up to and including all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཟུགས་ལ་རྟོག་པ་མ་ཡིན་ནོ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings do not appraise physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་རྟོག་པ་མ་ཡིན་ནོ།
en: They do not appraise feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་རྟོག་པ་མ་ཡིན་ནོ།
en: They do not appraise the sense fields, the sensory elements, or the links of dependent origination.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་རྟོག་པ་མ་ཡིན་ནོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: They do not appraise any of the perfections, any of the aspects of emptiness, or the thirty-seven factors conducive to enlightenment.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: They do not appraise the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways. {

source: མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་རྟོག་པ་མ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: Ki.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་རྟོག་པ་མ་ཡིན་ནོ།
en: IV: 114} They do not appraise the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་རྟོག་པ་མ་ཡིན་ནོ།
en: They do not appraise [the goals], up to and including all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་སུས་ཀྱང་མ་བྱས་རྣམ་པར་མ་བྱས།
en: If you ask why, Subhūti, it is because this all-aspect omniscience [and so forth] has not been created, destroyed, or brought into being by anyone.

source: མངོན་པར་མ་བྱས། གང་ནས་ཀྱང་མ་འོངས།
en: It has not come from anywhere and it will not go anywhere.

source: གང་དུ་ཡང་མ་སོང་། །ཕྱོགས་ན་ཡང་མི་གནས། ཡུལ་ན་ཡང་མི་གནས་གང་ན་ཡང་མི་གནས་པ་སྟེ།
en: It does not dwell in any direction, nor does it dwell in any place—it does not dwell anywhere at all.

source: དེ་ལ་གྲངས་མི་དམིགས་སོ།
en: In it no number is apprehended.

source: །འགྲོ་བ་དང་འོང་བ་ཡང་མི་དམིགས་སོ།
en: Going and coming are not apprehended.

source: །གང་ལ་གྲངས་མི་དམིགས་ཤིང་འགྲོ་བ་དང་འོང་བ་མི་དམིགས་པ་དེ་ལ་ནི་གང་གིས་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་ཏེ།
en: There is no one indeed who can attain consummate buddhahood with respect to that in which number is not apprehended, and going and coming are not apprehended. “[

source: གཟུགས་ཀྱིས་མ་ཡིན་ནོ།
en: Manifestly perfect buddhahood] is not attained by means of physical forms.
